In [22]:
import pandas as pd
data={
    "Date":['6/7/25','8/8/25','12/6/25'],
    "Event":["shopping","marketing","frut saller"],
    "Cost":[2000,3000,1400]
}
df=pd.DataFrame(data)
df

      Date        Event  Cost
0   6/7/25     shopping  2000
1   8/8/25    marketing  3000
2  12/6/25  frut saller  1400

## ADDING  A TWO NEW COLUMN COUNT AND DISCOUNT

In [23]:

df["Discount_price"]=df.apply(lambda row:row.Cost - (row.Cost*0.1),axis=1)
df["Discount"]=df.apply(lambda row:row.Cost - row.Discount_price,axis=1)
print(df)

      Date        Event  Cost  Discount_price  Discount
0   6/7/25     shopping  2000          1800.0     200.0
1   8/8/25    marketing  3000          2700.0     300.0
2  12/6/25  frut saller  1400          1260.0     140.0

## ADD TWO MORE EVENTS DATA OBJECTS TO DATASET

In [24]:
df.loc[len(df.index)]=['13/4/25','vegetables saller',4000,3000,1000]
df.loc[len(df.index)]=['14/5/25','bookshop',400,350,150]
df

      Date              Event  Cost  Discount_price  Discount
0   6/7/25           shopping  2000          1800.0     200.0
1   8/8/25          marketing  3000          2700.0     300.0
2  12/6/25        frut saller  1400          1260.0     140.0
3  13/4/25  vegetables saller  4000          3000.0    1000.0
4  14/5/25           bookshop   400           350.0     150.0

## MERGING THE  TWO FILE

In [17]:
import pandas as pd
data={
    "Date":['3/9/25','5/1/25','11/7/25'],
    "Event":["House rent","Milk rate","water bill"],
    "Cost":[3000,300,140]
}
df1=pd.DataFrame(data)
df1

      Date       Event  Cost
0   3/9/25  House rent  3000
1   5/1/25   Milk rate   300
2  11/7/25  water bill   140